# IFCParameter Template Get Active Template Method

Source: https://www.revitapidocs.com/2026/132c18c5-70b3-41f6-b966-47aed0879ddf.htm

---

| IFCParameter Template Get Active Template Method |
| --- |

Gets the active mapping template element in the document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCParameterTemplate GetActiveTemplate(
	Document document
)
```

```
Public Shared Function GetActiveTemplate (
	document As Document
) As IFCParameterTemplate
```

```
public:
static IFCParameterTemplate^ GetActiveTemplate(
	Document^ document
)
```

```
static member GetActiveTemplate :
        document : Document -> IFCParameterTemplate
```

#### Parameters

document Document
:   The document to find the active mapping template.

#### Return Value

IFCParameterTemplate
The active mapping template, or if none. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

Remarks New documents have no active mapping template and it implies in\-session template usage. See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace